docs/comp-sci/theorem-provers/mizar/minimal-counterexample.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Proof by Minimal Counter-Example in Mizar</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Proof by Minimal Counter-Example in Mizar</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-3b279867-b821-4009-afb9-24b57edfbb39">1. Using Kuratowski&#x2013;Zorn Lemma</a></li>
<li><a href="#h-a073a849-4e9f-46c9-8f85-993116c3e782">2. References</a></li>
</ul>
</div>
</div>
<p>
In finite group theory, we often use a technique called "proof by
minimal counter-example". Often we just say, "Suppose \(G\) is a minimal
counter-example to the claim", then get to work. We could formalize this
in Mizar using the following sketch:
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-formula">for</span> G <span class="org-mizar-formula">being</span> finite Group
<span class="org-mizar-formula">holds</span> P[G]
<span class="org-mizar-block">proof</span>
  set A = { n <span class="org-mizar-normal">where</span> n <span class="org-mizar-normal">is</span> Element <span class="org-mizar-normal">of</span> NAT : <span class="org-mizar-formula">ex</span> G <span class="org-mizar-formula">being</span> finite Group
                                          <span class="org-mizar-formula">st</span> n = card G <span class="org-mizar-formula">&amp;</span> <span class="org-mizar-formula">not</span> P[G] };
  A <span class="org-mizar-normal">is</span> non empty <span class="org-mizar-formula">implies</span> <span class="org-mizar-normal">contradiction</span>
  <span class="org-mizar-block">proof</span>
    <span class="org-mizar-skeleton">assume</span> A1: A <span class="org-mizar-normal">be</span> non empty;
    <span class="org-mizar-normal">defpred</span> P1[Nat] <span class="org-mizar-normal">means</span> <span class="org-mizar-formula">ex</span> x <span class="org-mizar-formula">being</span> object <span class="org-mizar-formula">st</span> x in A <span class="org-mizar-formula">&amp;</span> x = $1;
    A2: <span class="org-mizar-formula">ex</span> k <span class="org-mizar-formula">being</span> Nat <span class="org-mizar-formula">st</span> P1[k]<span class="org-type"> by A1, XBOOLE_0:def 1</span>;
    <span class="org-mizar-normal">consider</span> n <span class="org-mizar-formula">being</span> Nat <span class="org-mizar-normal">such</span> <span class="org-mizar-normal">that</span>
    A3: P1[n] <span class="org-mizar-formula">&amp;</span> <span class="org-mizar-formula">for</span> k <span class="org-mizar-formula">being</span> Nat <span class="org-mizar-formula">st</span> P1[k] <span class="org-mizar-formula">holds</span> n &lt;= k
   <span class="org-type"> from NAT_1:sch 5(A2)</span>;
    <span class="org-mizar-normal">consider</span> G <span class="org-mizar-formula">being</span> finite Group <span class="org-mizar-normal">such</span> <span class="org-mizar-normal">that</span>
    A4: n = card G <span class="org-mizar-formula">&amp;</span> <span class="org-mizar-formula">not</span> P[G]
   <span class="org-type"> by A3</span>;
    <span class="org-mizar-formula">ex</span> H <span class="org-mizar-formula">being</span> finite Group <span class="org-mizar-formula">st</span> card H &lt; n <span class="org-mizar-formula">&amp;</span> <span class="org-mizar-formula">not</span> P[H]
    <span class="org-mizar-block">proof</span>
      <span class="org-comment-delimiter">:: </span><span class="org-comment">...</span>
    <span class="org-mizar-block">end</span>;
    <span class="org-mizar-skeleton">hence</span> <span class="org-mizar-normal">contradiction</span><span class="org-type"> by A4</span>;
  <span class="org-mizar-block">end</span>;
<span class="org-mizar-block">end</span>;
</pre>
</div>

<p>
The "minimality" condition is enforced by <a href="http://mizar.org/version/current/html/nat_1.html#S5"><code>NAT_1:sch 5</code></a>.
</p>

<div id="outline-container-h-3b279867-b821-4009-afb9-24b57edfbb39" class="outline-2">
<h2 id="h-3b279867-b821-4009-afb9-24b57edfbb39"><span class="section-number-2">1.</span> Using Kuratowski&#x2013;Zorn Lemma</h2>
<div class="outline-text-2" id="text-h-3b279867-b821-4009-afb9-24b57edfbb39">
<p>
One could alternatively create a <a href="http://mizar.org/version/current/html/orders_2.html#NM1"><code>Poset</code></a> of finite groups using
<code>is Subgroup of</code> as the ordering relation. Then minimality would be
enforced using the <a href="http://mizar.org/version/current/html/orders_2.html#T56">Kuratowski&#x2013;Zorn lemma</a>. This requires proving, for
any chain of subgroups, there is a minimal element&#x2026;which is true, it's
the trivial group.
</p>

<p>
Then proof-by-minimal counterexample would consider the subset of the
poset <code>FiniteGroups</code> which consists of groups which do not satisfy the
predicate. We'd need to rely on the fact that subsets of chains are
chains (<a href="http://mizar.org/version/current/html/orders_2.html#T10"><code>ORDERS_2:10</code></a>). I think we'd need to prove that a Subset of a
Poset forms another Poset.
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-formula">for</span> A <span class="org-mizar-formula">being</span> non empty Poset
<span class="org-mizar-formula">for</span> B <span class="org-mizar-formula">being</span> non empty Subset <span class="org-mizar-normal">of</span> A
<span class="org-mizar-formula">holds</span> RelStr(# B, (the InternalRel <span class="org-mizar-normal">of</span> A) /\ [: B, B :] #) <span class="org-mizar-normal">is</span> Poset;

<span class="org-mizar-main">definition</span>
  <span class="org-mizar-normal">func</span> FiniteGroups -&gt; RelStr <span class="org-mizar-normal">means</span>
  :Def:
  (<span class="org-mizar-formula">for</span> x <span class="org-mizar-formula">being</span> object <span class="org-mizar-formula">holds</span> x <span class="org-mizar-normal">is</span> strict finite Group <span class="org-mizar-formula">iff</span> x in the carrier <span class="org-mizar-normal">of</span> <span class="org-mizar-normal">it</span>)
  (<span class="org-mizar-formula">for</span> x,y <span class="org-mizar-formula">being</span> object <span class="org-mizar-formula">st</span> x <span class="org-mizar-normal">is</span> strict finite Group <span class="org-mizar-formula">&amp;</span> y <span class="org-mizar-normal">is</span> strict finite Group
   <span class="org-mizar-formula">holds</span> [x,y] in (the InternalRel <span class="org-mizar-normal">of</span> <span class="org-mizar-normal">it</span>) <span class="org-mizar-formula">iff</span> x <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> y);
  <span class="org-mizar-normal">existence</span>;
  <span class="org-mizar-normal">uniqueness</span>;
<span class="org-mizar-block">end</span>;

<span class="org-comment-delimiter">:: </span><span class="org-comment">reflexivity by GROUP_2:54</span>
<span class="org-comment-delimiter">:: </span><span class="org-comment">antisymmetric by GROUP_2:55</span>
<span class="org-comment-delimiter">:: </span><span class="org-comment">transitivity by GROUP_2:56</span>
<span class="org-mizar-main">registration</span>
  <span class="org-mizar-normal">cluster</span> FiniteGroups -&gt; reflexive transitive antisymmetric;
  <span class="org-mizar-normal">correctness</span>;
<span class="org-mizar-block">end</span>;
<span class="org-comment-delimiter">:: </span><span class="org-comment">Thus FiniteGroups is a Poset</span>
</pre>
</div>

<p>
This might be "too strong" a condition, in the sense we may want the
relation to be: <code>[x,y] in (the InternalRelation of it) iff ex z being Subgroup of y st x,z are_isomorphic</code>.
This weaker version would allow \(G\leq G\times H\), for example.
</p>

<div class="org-src-container">
<pre class="src src-mizar"><span class="org-mizar-main">scheme</span>
MinCounterEx { P[finite Group] } :
  <span class="org-mizar-formula">for</span> G <span class="org-mizar-formula">being</span> finite Group <span class="org-mizar-formula">holds</span> P[G]
<span class="org-mizar-normal">provided</span>
  A1: (<span class="org-mizar-formula">ex</span> G <span class="org-mizar-formula">being</span> finite Group
       <span class="org-mizar-formula">st</span> (<span class="org-mizar-formula">for</span> H <span class="org-mizar-formula">being</span> finite Group <span class="org-mizar-formula">st</span> <span class="org-mizar-formula">not</span> P[H]
           <span class="org-mizar-formula">holds</span> <span class="org-mizar-formula">not</span> (H <span class="org-mizar-normal">is</span> Subgroup <span class="org-mizar-normal">of</span> G))
        <span class="org-mizar-formula">&amp;</span> <span class="org-mizar-formula">not</span> P[G])
      <span class="org-mizar-formula">implies</span> <span class="org-mizar-normal">contradiction</span>
<span class="org-mizar-block">proof</span> <span class="org-mizar-block">end</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-h-a073a849-4e9f-46c9-8f85-993116c3e782" class="outline-2">
<h2 id="h-a073a849-4e9f-46c9-8f85-993116c3e782"><span class="section-number-2">2.</span> References</h2>
<div class="outline-text-2" id="text-h-a073a849-4e9f-46c9-8f85-993116c3e782">
<ul class="org-ul">
<li><a href="https://groupprops.subwiki.org/wiki/Induction_for_finite_groups">https://groupprops.subwiki.org/wiki/Induction_for_finite_groups</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2023-01-20 Fri 10:55.</p>
</div>
</body>
</html>